Tekla Open API Reference for Tekla Structures 2025
TemplateInfo Class
 The TemplateInfo class holds template information.
Inheritance Hierarchy
System.Object
 Tekla.Structures.Drawing.GenericAttributesBase
 Tekla.Structures.Drawing.TemplateInfo
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public sealed class TemplateInfo : GenericAttributesBase
<SerializableAttribute>
Public NotInheritable Class TemplateInfo
	Inherits GenericAttributesBase
The TemplateInfo type exposes the following members.
Constructors
Name | Description
TemplateInfo()
 Creates a new template info instance.
TemplateInfo(String)
 Creates a new template info instance with the given template file name.
Top
Properties
Name | Description
Name
 Gets or sets the name of the template file. E.g. "revision".
Top
Methods
Name | Description
IsEqual
 Compares the current object with an object of the same type.
 (Overrides GenericAttributesBase.IsEqual(Object).)
Top
Fields
Name | Description
Default
 The default template information.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace